import { Crypto, load, _ } from 'assets://js/lib/cat.js';

let key = 'chabeihu';
let HOST = 'https://www.725998.com';
let siteKey = '';
let siteType = 0;

const UA = 'Mozilla/5.0 (iPhone; CPU iPhone OS 13_2_3 like Mac OS X) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/13.0.3 Mobile/15E148 Safari/604.1';

async function request(reqUrl) {
    const res = await req(reqUrl, {
        method: 'get',
        headers: {
            'User-Agent': UA,
            'Referer': HOST
        },
    });
    return res.content;
}

// cfg = {skey: siteKey, ext: extend}
async function init(cfg) {
    siteKey = cfg.skey;
    siteType = cfg.stype;
}

async function home(filter) {
    const classes = [{'type_id':'1','type_name':'电影'},{'type_id':'2','type_name':'电视剧'},{'type_id':'3','type_name':'动漫'},{'type_id':'4','type_name':'纪录片'}];
    const filterObj = {
        '1':[{'key':'class','name':'剧情','init':'','value':[{'n':'全部','v':''},{'n':'剧情','v':'1'},{'n':'喜剧','v':'2'},{'n':'动作','v':'3'},{'n':'爱情','v':'4'},{'n':'科幻','v':'5'},{'n':'悬疑','v':'6'},{'n':'惊悚','v':'7'},{'n':'恐怖','v':'8'},{'n':'理论','v':'9'},{'n':'犯罪','v':'10'},{'n':'奇幻','v':'11'},{'n':'冒险','v':'12'},{'n':'灾难','v':'13'},{'n':'传记','v':'14'},{'n':'战争','v':'15'},{'n':'历史','v':'16'},{'n':'古装','v':'17'},{'n':'武侠','v':'18'},{'n':'同性','v':'19'},{'n':'音乐','v':'20'},{'n':'歌舞','v':'21'},{'n':'运动','v':'22'},{'n':'西部','v':'23'},{'n':'黑色电影','v':'黑色24'},{'n':'短片','v':'25'}]},
{'key':'area','name':'地区','init':'','value':[{'n':'全部','v':''},{'n':'美国','v':'26'},{'n':'英国','v':'27'},{'n':'韩国','v':'28'},{'n':'日本','v':'29'},{'n':'中国大陆','v':'30'},{'n':'中国香港','v':'31'},{'n':'中国台湾','v':'32'},{'n':'法国','v':'33'},{'n':'德国','v':'34'},{'n':'俄罗斯','v':'35'},{'n':'泰国','v':'36'},{'n':'印度','v':'37'},{'n':'意大利','v':'38'},{'n':'加拿大','v':'39'},{'n':'西班牙','v':'40'},{'n':'澳大利亚','v':'41'},{'n':'比利时','v':'42'},{'n':'瑞典','v':'43'},{'n':'伊朗','v':'44'}]},
{'key':'year','name':'年代','init':'','value':[{'n':'全部','v':''},{'n':'2024','v':'85'},{'n':'2023','v':'84'},{'n':'2022','v':'83'},{'n':'2021','v':'62'},{'n':'2020','v':'63'},{'n':'2019','v':'64'},{'n':'2018','v':'65'},{'n':'2017','v':'66'},{'n':'2016','v':'67'},{'n':'2015','v':'68'},{'n':'2014','v':'69'},{'n':'2013','v':'70'},{'n':'2012','v':'71'},{'n':'2011','v':'72'},{'n':'2010','v':'73'}]},{'key':'select','name':'精选','init':'','value':[{'n':'全部','v':''},{'n':'即将上映','v':'45'},{'n':'热门推荐','v':'46'},{'n':'获奖作品','v':'47'},{'n':'新片榜','v':'48'},{'n':'一周口碑榜','v':'49'},{'n':'豆瓣热门','v':'50'},{'n':'经典佳作','v':'51'},{'n':'豆瓣高分','v':'52'},{'n':'冷门佳片','v':'53'},{'n':'豆瓣250','v':'54'},{'n':'美剧','v':'55'},{'n':'英剧','v':'56'},{'n':'韩剧','v':'57'},{'n':'日剧','v':'58'},{'n':'国产剧','v':'59'},{'n':'日本动画','v':'60'}]}],
        '2':[{'key':'class','name':'剧情','init':'','value':[{'n':'全部','v':''},{'n':'剧情','v':'1'},{'n':'喜剧','v':'2'},{'n':'动作','v':'3'},{'n':'爱情','v':'4'},{'n':'科幻','v':'5'},{'n':'悬疑','v':'6'},{'n':'惊悚','v':'7'},{'n':'恐怖','v':'8'},{'n':'理论','v':'9'},{'n':'犯罪','v':'10'},{'n':'奇幻','v':'11'},{'n':'冒险','v':'12'},{'n':'灾难','v':'13'},{'n':'传记','v':'14'},{'n':'战争','v':'15'},{'n':'历史','v':'16'},{'n':'古装','v':'17'},{'n':'武侠','v':'18'},{'n':'同性','v':'19'},{'n':'音乐','v':'20'},{'n':'歌舞','v':'21'},{'n':'运动','v':'22'},{'n':'西部','v':'23'},{'n':'黑色电影','v':'黑色24'},{'n':'短片','v':'25'}]},
{'key':'area','name':'地区','init':'','value':[{'n':'全部','v':''},{'n':'美国','v':'26'},{'n':'英国','v':'27'},{'n':'韩国','v':'28'},{'n':'日本','v':'29'},{'n':'中国大陆','v':'30'},{'n':'中国香港','v':'31'},{'n':'中国台湾','v':'32'},{'n':'法国','v':'33'},{'n':'德国','v':'34'},{'n':'俄罗斯','v':'35'},{'n':'泰国','v':'36'},{'n':'印度','v':'37'},{'n':'意大利','v':'38'},{'n':'加拿大','v':'39'},{'n':'西班牙','v':'40'},{'n':'澳大利亚','v':'41'},{'n':'比利时','v':'42'},{'n':'瑞典','v':'43'},{'n':'伊朗','v':'44'}]},
{'key':'year','name':'年代','init':'','value':[{'n':'全部','v':''},{'n':'2024','v':'85'},{'n':'2023','v':'84'},{'n':'2022','v':'83'},{'n':'2021','v':'62'},{'n':'2020','v':'63'},{'n':'2019','v':'64'},{'n':'2018','v':'65'},{'n':'2017','v':'66'},{'n':'2016','v':'67'},{'n':'2015','v':'68'},{'n':'2014','v':'69'},{'n':'2013','v':'70'},{'n':'2012','v':'71'},{'n':'2011','v':'72'},{'n':'2010','v':'73'}]},{'key':'select','name':'精选','init':'','value':[{'n':'全部','v':''},{'n':'即将上映','v':'45'},{'n':'热门推荐','v':'46'},{'n':'获奖作品','v':'47'},{'n':'新片榜','v':'48'},{'n':'一周口碑榜','v':'49'},{'n':'豆瓣热门','v':'50'},{'n':'经典佳作','v':'51'},{'n':'豆瓣高分','v':'52'},{'n':'冷门佳片','v':'53'},{'n':'豆瓣250','v':'54'},{'n':'美剧','v':'55'},{'n':'英剧','v':'56'},{'n':'韩剧','v':'57'},{'n':'日剧','v':'58'},{'n':'国产剧','v':'59'},{'n':'日本动画','v':'60'}]}],
        '3':[{'key':'class','name':'剧情','init':'','value':[{'n':'全部','v':''},{'n':'剧情','v':'1'},{'n':'喜剧','v':'2'},{'n':'动作','v':'3'},{'n':'爱情','v':'4'},{'n':'科幻','v':'5'},{'n':'悬疑','v':'6'},{'n':'惊悚','v':'7'},{'n':'恐怖','v':'8'},{'n':'理论','v':'9'},{'n':'犯罪','v':'10'},{'n':'奇幻','v':'11'},{'n':'冒险','v':'12'},{'n':'灾难','v':'13'},{'n':'传记','v':'14'},{'n':'战争','v':'15'},{'n':'历史','v':'16'},{'n':'古装','v':'17'},{'n':'武侠','v':'18'},{'n':'同性','v':'19'},{'n':'音乐','v':'20'},{'n':'歌舞','v':'21'},{'n':'运动','v':'22'},{'n':'西部','v':'23'},{'n':'黑色电影','v':'黑色24'},{'n':'短片','v':'25'}]},
{'key':'area','name':'地区','init':'','value':[{'n':'全部','v':''},{'n':'美国','v':'26'},{'n':'英国','v':'27'},{'n':'韩国','v':'28'},{'n':'日本','v':'29'},{'n':'中国大陆','v':'30'},{'n':'中国香港','v':'31'},{'n':'中国台湾','v':'32'},{'n':'法国','v':'33'},{'n':'德国','v':'34'},{'n':'俄罗斯','v':'35'},{'n':'泰国','v':'36'},{'n':'印度','v':'37'},{'n':'意大利','v':'38'},{'n':'加拿大','v':'39'},{'n':'西班牙','v':'40'},{'n':'澳大利亚','v':'41'},{'n':'比利时','v':'42'},{'n':'瑞典','v':'43'},{'n':'伊朗','v':'44'}]},
{'key':'year','name':'年代','init':'','value':[{'n':'全部','v':''},{'n':'2024','v':'85'},{'n':'2023','v':'84'},{'n':'2022','v':'83'},{'n':'2021','v':'62'},{'n':'2020','v':'63'},{'n':'2019','v':'64'},{'n':'2018','v':'65'},{'n':'2017','v':'66'},{'n':'2016','v':'67'},{'n':'2015','v':'68'},{'n':'2014','v':'69'},{'n':'2013','v':'70'},{'n':'2012','v':'71'},{'n':'2011','v':'72'},{'n':'2010','v':'73'}]},{'key':'select','name':'精选','init':'','value':[{'n':'全部','v':''},{'n':'即将上映','v':'45'},{'n':'热门推荐','v':'46'},{'n':'获奖作品','v':'47'},{'n':'新片榜','v':'48'},{'n':'一周口碑榜','v':'49'},{'n':'豆瓣热门','v':'50'},{'n':'经典佳作','v':'51'},{'n':'豆瓣高分','v':'52'},{'n':'冷门佳片','v':'53'},{'n':'豆瓣250','v':'54'},{'n':'美剧','v':'55'},{'n':'英剧','v':'56'},{'n':'韩剧','v':'57'},{'n':'日剧','v':'58'},{'n':'国产剧','v':'59'},{'n':'日本动画','v':'60'}]}],
        '4':[{'key':'class','name':'剧情','init':'','value':[{'n':'全部','v':''},{'n':'剧情','v':'1'},{'n':'喜剧','v':'2'},{'n':'动作','v':'3'},{'n':'爱情','v':'4'},{'n':'科幻','v':'5'},{'n':'悬疑','v':'6'},{'n':'惊悚','v':'7'},{'n':'恐怖','v':'8'},{'n':'理论','v':'9'},{'n':'犯罪','v':'10'},{'n':'奇幻','v':'11'},{'n':'冒险','v':'12'},{'n':'灾难','v':'13'},{'n':'传记','v':'14'},{'n':'战争','v':'15'},{'n':'历史','v':'16'},{'n':'古装','v':'17'},{'n':'武侠','v':'18'},{'n':'同性','v':'19'},{'n':'音乐','v':'20'},{'n':'歌舞','v':'21'},{'n':'运动','v':'22'},{'n':'西部','v':'23'},{'n':'黑色电影','v':'黑色24'},{'n':'短片','v':'25'}]},
{'key':'area','name':'地区','init':'','value':[{'n':'全部','v':''},{'n':'美国','v':'26'},{'n':'英国','v':'27'},{'n':'韩国','v':'28'},{'n':'日本','v':'29'},{'n':'中国大陆','v':'30'},{'n':'中国香港','v':'31'},{'n':'中国台湾','v':'32'},{'n':'法国','v':'33'},{'n':'德国','v':'34'},{'n':'俄罗斯','v':'35'},{'n':'泰国','v':'36'},{'n':'印度','v':'37'},{'n':'意大利','v':'38'},{'n':'加拿大','v':'39'},{'n':'西班牙','v':'40'},{'n':'澳大利亚','v':'41'},{'n':'比利时','v':'42'},{'n':'瑞典','v':'43'},{'n':'伊朗','v':'44'}]},
{'key':'year','name':'年代','init':'','value':[{'n':'全部','v':''},{'n':'2024','v':'85'},{'n':'2023','v':'84'},{'n':'2022','v':'83'},{'n':'2021','v':'62'},{'n':'2020','v':'63'},{'n':'2019','v':'64'},{'n':'2018','v':'65'},{'n':'2017','v':'66'},{'n':'2016','v':'67'},{'n':'2015','v':'68'},{'n':'2014','v':'69'},{'n':'2013','v':'70'},{'n':'2012','v':'71'},{'n':'2011','v':'72'},{'n':'2010','v':'73'}]},{'key':'select','name':'精选','init':'','value':[{'n':'全部','v':''},{'n':'即将上映','v':'45'},{'n':'热门推荐','v':'46'},{'n':'获奖作品','v':'47'},{'n':'新片榜','v':'48'},{'n':'一周口碑榜','v':'49'},{'n':'豆瓣热门','v':'50'},{'n':'经典佳作','v':'51'},{'n':'豆瓣高分','v':'52'},{'n':'冷门佳片','v':'53'},{'n':'豆瓣250','v':'54'},{'n':'美剧','v':'55'},{'n':'英剧','v':'56'},{'n':'韩剧','v':'57'},{'n':'日剧','v':'58'},{'n':'国产剧','v':'59'},{'n':'日本动画','v':'60'}]}]
    };
    return JSON.stringify({
        class: classes,
        filters: filterObj,
    });
}

async function homeVod() {}

async function category(tid, pg, filter, extend) {
    if (pg <= 0) pg = 1;
    const link = HOST + '/yingku-list/' + tid + '-' + (extend.class || '0') + '-' + (extend.area || '0') + '-' + (extend.year || '0') + '-' + (extend.select || '0') + '-0-' + pg + '.html';
    const html = await request(link);
    const $ = load(html);
    const items = $('.movies > a');
    const jsBase = await js2Proxy(true, siteType, siteKey, 'img/', {});
    const videos = _.map(items, (item) => {
        const $item = $(item);
        const a = $item;
        const div = $item.next();
        const img = div.find('.orginSrc');
        const remarks = div.find('.rating').text();
        return {
            vod_id: a.attr('href').replace(/.*?\/movie\/(.*).html/g, '$1'),
            vod_name: a.attr('title'),
            vod_pic: jsBase + base64Encode(HOST + img.attr('src')),
            vod_remarks: '评分：' + remarks.trim(),
        };
    });
    const limit = 28;
    const curPage = parseInt(pg);
    const hasMore = $('.mainPage .next').length > 0;
    const pgCount = hasMore ? curPage + 1 : curPage;
    return {
        page: curPage,
        pagecount: pgCount,
        limit: limit,
        total: limit * pgCount,
        list: videos,
    };
}

function base64Encode(text) {
    return Crypto.enc.Base64.stringify(Crypto.enc.Utf8.parse(text));
}

function base64Decode(text) {
    return Crypto.enc.Utf8.stringify(Crypto.enc.Base64.parse(text));
}

async function proxy(segments, headers) {
    const what = segments[0];
    const url = base64Decode(segments[1]);
    if (what == 'img') {
        const resp = await req(url, {
            buffer: 1,
            shared: 1,
            headers: {
                'User-Agent': UA,
            },
        });
        return {
            code: resp.code,
            buffer: 3,
            content: resp.content,
            headers: resp.headers,
        };
    }
    return {
        code: 500,
        content: '',
    };
}

async function detail(id) {}

async function play(flag, id, flags) {}

async function search(wd, quick) {}

export function __jsEvalReturn() {
    return {
        init: init,
        home: home,
        homeVod: homeVod,
        category: category,
        detail: detail,
        play: play,
        proxy: proxy,
        search: search,
    };
}